import { createSlice } from "@reduxjs/toolkit";

export const blogsReducer = createSlice({
    name: 'blogs',
    initialState: {
        blogs: [    {
        title: "12 сезонів жінки ",
        content: `
[✍️]  Ксенія Фукс
[📖]  240

[📢]  Чесно — відчувається, що книга написана так-сяк, оскільки деякі новели посередні та "ні про що". Так, тут висвітлено багато дійсно важливих тем, та я вважаю, що це можна було б зробити не настільки по-дитячому й не настільки "в лоб". Тобто після прочитання взагалі не виникає бажання зупинитись і задуматись. 
Проте й дещо непогане зустрічається. 

Кожна історія починається ілюстрацією, яка так чи інакше зображує характерні риси конкретної дівчини, та віршем, що натякає на подальший сюжет. 
Не можу не відмітити те, що хоч історії про різних людей, більшість містить згадки одна про одну. Саме тому виникає відчуття, наче читаєш роман, а не окремі уривки.

Особисто мене зачепила новела про війну та Донецьк (цитату звідти я наводила не так давно). Вона містить в собі переважно позитивні моменти, проте причина їх виникнення навіює печаль.

P. S. У авторки є книга "12 годин чоловіка", не скажу, що горю бажанням її прочитати, але було б цікаво побачити, чи відрізняються чимось книги (крім того, що ця про чоловіків). 
        `,
        author: "lavender",
        date: "july 7",
    }, {
        title: "Листопадова жінка ",
        content: `
[✍️]  Аліна Воловичева
[📖]  264

[📢]  Насправді книга має дуже хороший посил та суть: потрібно жити своїми бажаннями та потребами, але не завжди думки виглядали свідомими та дорослими (головній героїні 26 років взагалі-то). 

Не скажу, що сюжет мене чимось вразив, але все ж було цікаво спостерігати за цим шляхом змін. Епізод із життя Насті записано у формі розмови з психотерапевтом, таким чином одразу ж відбувається й аналіз певних дій. 

Я б назвала це найбільш нейтральною книгою, яку я читала за останній час. `,
        author: "lavender",
        date: "july 4",
    }, {
        title: "Вікторія Амеліна",
        content: `Немає слів, щоб описати всю ненависть, яку я відчуваю до країни гнилі, країни тероризму та країни нелюдів.

        1 липня загинула письменниця Вікторія Амеліна внаслідок поранень. На її книгу "Дім для Дома" я не так давно писала рецензію. А на Книжковому Арсеналі дівчина представляла щоденник вбитого росіянами дитячого письменника Володимира Вакуленка. Вона хотіла, аби пам'ять про нього не зникла ніколи. 
        Не хочеться вірити в те, що це правда. 
        
        Вічна пам'ять.`,
        author: "lavander",
        date: "july 3",
    }, {
        title: "Ворошиловград",
        content: `
        [✍️]  Сергій Жадан
        [📖]  552
        
        [📢]  Якщо описувати однією фразою: дуже шкода, що витратила на це свій час. 
        
        Не буду стверджувати, що книга абсолютно жахлива, оскільки все ж деяка публіка любить твори Жадана, але тепер розумію, що ця творчість — зовсім не моє. 
        
        Починається все непогано: знайомство із головним героєм, мотивація його дій та виникнення певної загадки (зникнення брата). Але якщо ви думаєте, що тепер кожен розділ буде наближати нас до логічного завершення, то ви глибоко помиляєтесь. 
        Єдине, що пов'язує між собою глави — місце дії та персонажі. Тобто якщо викинути звідти будь-яку частину тексту, то не зміниться абсолютно нічого. Саме через це в мене виникло відчуття, наче я прочитала не завершену книгу, а лише чернетку/замальовку до неї. 
        
        Можливо я забагато хочу (ні), проте мене засмутила відсутність будь-яких логічних пояснень подій, у які потрапляють герої. Залишається лише або як-небудь здогадуватися, або прийняти той факт, що роман існує окремо від читача. 
        
        На жаль, це той випадок, коли довелось книгу буквально запихувати собі в голову, аби написати рецензію більш-менш знаючи сюжет. А відчувається це так, наче я здійснила насилля над власним мозком 🙃. `,
        author: "lavander",
        date: "july 1",
    }, 
        
        ]
    },
    reducers: {
        push: (state, element) => {
            state.blogs.push(element.payload);
        },
        remove: (state, index) => {
            state.blogs.splice(index.payload, 1);
        }, 
        update: (state, obj) => {
            

            /*
            let obj = {
                index: index,
                new: {
                    title: title,
                    content: content,
                    author: author,
                    date:date
                }
            }
            */
            let index = obj.payload.index;
            let newBlog = obj.payload.new;
            let blogs = [... state.blogs];
            blogs[index] = newBlog;
            state.blogs = blogs;
        }
    }
});

export const { push, remove, update } = blogsReducer.actions;
export default blogsReducer.reducer;
